Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Now when you click the Add button (+), create a new meal, and click Save, you should see the new meal in your meal list.
ja: 今ではあなたがAddボタン（+）をクリックして、新しい食事が作成され、そしてSaveをクリックする時、あなたは新しい食事をあなたの食事リストの中に見るはずです。

source: Now when you click the Add button (+), the Save button is disabled until you enter a valid (nonempty) meal name and dismiss the keyboard.
ja: 今ではあなたがAddボタン（+）をクリックする時、Saveボタンはあなたが有効な（空でない）食事名を入力してキーボードを片付けるまで使用不能にされます。

source: Now you need to create the actual unwind segue to trigger this action method.
ja: 次にあなたが必要とするのは、このアクションメソッドを引き起こす、実際の巻き戻しセグエを作成することです。

source: Now you need to display this data in the user interface.
ja: 次にあなたが必要とするのは、このデータをユーザインターフェイスに表示することです。

source: Now you need to use these values.
ja: 今度はあなたはこれらの値を使うことを必要とします。

source: Now you’ll create a data model to store the information that the meal scene needs to display.
ja: 今あなたはあるデータモデルを作成して、食事シーンが表示するために必要とする情報を格納しようとしています。

source: Now, add a button (UIButton) to the scene.
ja: 今度は、ボタン（UIButton）をシーンに追加します。

source: Now, connect that gesture recognizer to an action method in your code.
ja: 今度は、このジェスチャリコグナイザをあなたのコードのアクションメソッドに接続します。

source: Now, connect the label to your code in the same way you connected the text field.
ja: 今度は、あなたがテキスト欄を接続したのと同じ方法でラベルをあなたのコードにつないでください。

source: Now, implement a method to load meals.
ja: 次に、食事をロードするメソッドを実装してください。

source: Now, open your storyboard again.
ja: 次に、再びあなたのストーリーボードを開いてください。

source: Now, remove the action method that corresponds with the button you deleted.
ja: 今度は、あなたが削除したボタンに対応するアクションメソッドを削除します。

source: Now, the buttons should be laid out as expected.
ja: 今では、ボタンは期待されるように配置されるはずです。

source: Now, use the meal object to configure your cell.
ja: 今度は、食事オブジェクトを使ってあなたのセルを構成設定してください。

source: Now, when users tap the Save button, they navigate back to the meal list scene, during which process the unwindToMealList(sender:) action method is called.
ja: 今では、ユーザがSaveボタンをタップする時、彼らは食事シーンリストへ導かれて戻ります、その処理の間にunwindToMealList(sender:)アクションメソッドが呼ばれます。

source: Now, you need to implement the functionality to change the image in this image view at runtime.
ja: 現在、あなたが必要とするのは、実行時にイメージビュー内の画像を変更する機能性を実装することです。

source: Now, you’ll add the meal list title and a button (to add additional meals) to the navigation bar.
ja: 今度は、あなたは食事リストタイトルとボタンを（追加の食事を加えるために）ナビゲーションバーに加えます。

source: Object library
ja: オブジェクトライブラリ

source: Of course, you’ll need to make some modifications both to the scene’s appearance and its behavior.
ja: もちろん、あなたは幾つかの修正を、シーンの持つ外観とそれの挙動の両方にする必要があります。

source: Older APIs used selectors to dynamically invoke methods at runtime.
ja: 古いAPIは、実行時に動的にメソッドを発動するためにセレクタを使いました。

source: On the canvas, select the table view cell in the meal list (Your Meals) scene.
ja: キャンバス上で、テーブルビューセルを食事リスト（Your Meals）シーンにおいて選択してください。

source: On the canvas, the icon connecting the controllers is the root view controller relationship.
ja: キャンバス上で、コントローラ同士を接続しているアイコンは、ルートビューコントローラ関係です。

source: On the bottom right of the canvas, click the Embed In Stack button.
ja: キャンバスの右下で、Embed In Stackボタンをクリックしてください。

source: On the bottom right of the canvas, open the Add New Constraints menu again.
ja: キャンバスの１番下右で、Add New Constraintsメニューをふたたび開いてください。

source: On the bottom right of the canvas, open the Add New Constraints menu.
ja: キャンバスの１番下右で、Add New Constraintsメニューを開いてください。

source: On the bottom right of the canvas, open the Pin menu.
ja: キャンバスの１番下右で、Pin（固定）メニューを開いてください。

source: On the canvas, Control-drag from the Save button to the Exit item at the top of the meal detail scene.
ja: キャンバス上で、Saveボタンから食事詳細シーン上部のExit項目までコントロール-ドラッグしてください。

source: On the canvas, select the Add button (+).
ja: キャンバス上で、追加ボタン（+）を選択してください。

source: On the canvas, select the newly added segue (the segue that runs directly from the meal list (Your Meals) scene to the meal detail (New Meal) scene).
ja: キャンバス上で、新しく追加されたセグエを選択してください（食事リスト（Your Meals）シーンから食事詳細（New Meal）シーンまで直接に駆けつけるセグエ）。

source: On the other hand, the table view controller is a full scene.
ja: 別の見方をすれば、テーブルビューコントローラは１つの完全なシーンです。

source: On the other hand, the top of the stack is constrained relative to the scene’s top layout guide.
ja: 別の見方をすれば、スタックの上部はシーンのもつ上部レイアウトガイドに関係して制約されます。

source: On your computer, select the empty star image you want to add.
ja: あなたのコンピュータ上で、あなたが加えようと思う空の星の画像を選択してください。

source: On your computer, select the filled-in star image you want to add.
ja: あなたのコンピュータ上で、あなたが加えようと思う塗りつぶされた星の画像を選択してください。

source: On your computer, select the image you want to add.
ja: あなたのコンピュータ上で、あなたが加えたい画像を選択してください。

source: On your computer, select the images you want to add.
ja: あなたのコンピュータ上で、あなたが追加したい画像を選択します。

source: Once the build completes, the storyboard shows a live view of your rating control.
ja: 一旦ビルドが完了したならば、ストーリーボードはあなたの格付けコントロールのライブビューを示します。

source: Once the rating is set, you need some way to update the button’s appearance.
ja: 一旦格付けが設定されたならば、あなたはボタンの外観を更新するための何らかの方法を必要とします。

source: Once you have the button’s index (in this case a value from 0 to 4), you add 1 to the index to calculate the selected rating (giving you a value from 1 to 5).
ja: 一旦あなたがボタンのインデックスを持つならば（この場合には０から４までの値）、あなたは１をインデックスに加えて選択された格付けを計算します（１から５までの値をあなたに与えます）。

source: One affects the currently selected view.
ja: １つは、現在選択されたビューに効果を及ぼします。

source: One of the easiest ways to define your layout is using a stack view (UIStackView).
ja: あなたのレイアウトを定義する最も簡単な方法の１つは、スタックビュー（UIStackView）を使うことです。

source: One of the primary initializers for a class; a convenience initializer within a class must ultimately call through to a designated initializer.
ja: あるクラスの主要イニシャライザの１つ；あるクラス内部の便宜イニシャライザは、最後には指定イニシャライザを呼ぶことに至らなければなりません。

source: Open FoodTrackerTests.swift.
ja: FoodTrackerTests.swiftを開いてください。

source: Open Main.storyboard.
ja: Main.storyboardを開いてください。

source: Open Meal.swift.
ja: Meal.swiftを開いてください。

source: Open MealTableViewController.swift.
ja: MealTableViewController.swiftを開いてください。

source: Open MealViewController.swift.
ja: MealViewController.swiftを開いてください。

source: Open ViewController.swift.
ja: ViewController.swiftを開いてください。

source: Open Camera Roll, and click one of the images you added to the simulator to select it and set it as the image in the image view.
ja: Camera Rollを開いて、あなたがシミュレータへ加えた画像の１つをクリックすることでそれを選択して、それをイメージビューの中の画像として設定してください。

source: Open Xcode from the /Applications directory.
ja: /ApplicationsディレクトリからXcodeを開きます。

source: Open Your Storyboard
ja: あなたのストーリーボードを開く

source: Open and switch between files in a project
ja: プロジェクト内のいくつかのファイルを開いてその間で切り替える

source: Open the Attributes inspector .
ja: Attributesインスペクタ を開いてください。

source: Open the Object library in the utility area.
ja: オブジェクトライブラリをユーティリティ区画で開きます。

source: Open the Object library.
ja: オブジェクトライブラリを開いてください。

source: Open the Attributes inspector , and set the Spacing attribute to 8.
ja: Attributesインスペクタ を開いて、Spacing属性を8に設定してください。

source: Open the App Store app on your Mac (by default it’s in the Dock).
ja: App StoreアプリをあなたのMacで開きます（初期状態でそれはDockにあります）。

source: Open the FoodTrackerTests folder in the project navigator by clicking the disclosure triangle next to it.
ja: FoodTrackerフォルダをプロジェクトナビゲータにおいてそれの隣の開示三角形をクリックすることで開いてください。

source: Open the Identity inspector .
ja: Identityインスペクタ を開いてください。

source: Open the Object library (Choose View > Utilities > Show Object Library).
ja: Objectライブラリを開いてください（View > Utilities > Show Object Libraryを選択してください）。

source: Open the Size inspector .
ja: Sizeインスペクタ を開いてください。

source: Open the project navigator and utility area by clicking the Navigator and Utilities buttons in the Xcode toolbar.
ja: プロジェクトナビゲータとユーティリティ区画をXcodeツールパーのNavigatorとUtilitiesボタンをクリックすることで開いてください。

source: Open your storyboard, Main.storyboard.
ja: あなたのストーリーボード、Main.storyboardを開いてください。

source: Open your storyboard and look at the meal detail scene.
ja: あなたのストーリーボードを開いて食事詳細シーンを見つけます。

source: Open your storyboard.
ja: あなたのストーリーボードを開いてください。

source: Optionals can either contain a valid value or nil.
ja: オプショナルは、有効な値またはnilのどちらかを含むことができます。

source: Organization Identifier: Your organization identifier, if you have one.
ja: 組織識別子。

source: Organization Name: The name of your organization or your own name.
ja: 組織名：あなたの組織の名前またはあなた自身の名前。

source: Other templates have more complex behavior.
ja: 他のひな形は、もっと複雑なふるまいをします。

source: Others, such as view controllers and gesture recognizers, define the behavior of your app but don’t appear onscreen.
ja: 他のもの、例えばビューコントローラやジェスチャリコグナイザ（ジェスチャー認識、身ぶり認識）は、あなたのアプリの挙動を定義しますが画面上には現れません。

source: Otherwise, it assigns a new Meal object to the the meal variable.
ja: それ以外では、それは新しいMealオブジェクトをmeal変数へ割り当てます。

source: Otherwise, the isSelected property is set to false, and the button shows the empty star image.
ja: それ以外では、isSelectedプロパティはfalseに設定され、ボタンは空の星画像を示します。

source: Otherwise, you set the rating to the selected rating.
ja: そうでなければ、あなたはratingを選択された格付けへ設定します。

source: Otherwise, your Apple ID is assigned to a personal team that you can use to launch apps on devices.
ja: そうでなければ、あなたのApple IDはある個人チームへ割り当てられて、それはあなたがデバイス上でアプリを起動するのに使うことができます。

source: Outlets let you refer to your interface elements in code, but you still need a way to respond whenever the user interacts with the elements.
ja: アウトレットは、あなたにコードにおいてあなたのインターフェイス要素を参照させます、しかしまだあなたにはユーザがそれら要素と相互作用するたびに応答する方法が必要です。

source: Outside of the Meal class, you’ll access the path using the syntax Meal.ArchiveURL.path.
ja: Mealクラスの外側で、あなたはパスに構文Meal.ArchiveURL.pathを使ってアクセスします。

source: Part of the Xcode workspace window that displays all the files in your project.
ja: Xcodeワークスペースウインドウの一部、あなたのプロジェクトの全てのファイルを表示します。

source: Part of the Xcode workspace window that shows a list of objects that can be added to a storyboard, including each object’s name, description, and visual representation.
ja: Xcodeワークスペースウインドウの一部、それは、ストーリーボードに加えることができるオブジェクトのリストを、各オブジェクトの名前、説明、そして視覚的な表現を含めて表示します。

source: Part of the Xcode toolbar that displays messages about the build process and other information.
ja: Xcodeツールバーの一部、ビルド過程や他の情報についてのメッセージを表示します。

source: Pass data between view controllers
ja: データをビューコントローラ間で渡す

source: Pass data between view controllers using the prepare(for:sender:) method
ja: データをビューコントローラ間でprepare(for:sender:)メソッドを使って渡す

source: Passing true to the animated parameter animates the presentation of the image picker controller.
ja: trueをanimatedパラメータに渡すと、イメージピッカーコントローラの実演を動画にします。

source: Pay careful attention to the exclamation point at the end of the type declaration.
ja: この型宣言の終わりの感嘆符をおろそかにしないでください。

source: Perform an unwind segue
ja: 巻き戻しセグエを実行する

source: Persist Data
ja: データ永続

source: Prepare the Meal Detail Scene for Navigation
ja: 食事詳細シーンをナビゲーションのために整える

source: Prerequisites
ja: 前もって必要なもの

source: Present scenes modally when they represent a task that the user must either complete or cancel before continuing (for example, adding a new meal).
ja: それらが１つの作業を表して、続きをする前にユーザが完了またはキャンセルしなければならないものである場合には（例えば、新しい食事の追加など）、それらシーンをモーダルに提示してください。

source: Present scenes using a navigation controller when the user is navigating through hierarchical data (for example, selecting a meal from a list of meals).
ja: ユーザが階層的なデータのあちこちを閲覧している場合には（例えば、食事リストからある食事を選択するなど）、シーンをナビゲータコントローラを使って提示してください。

source: Press Return to display the new cell height in your storyboard.
ja: リターンキーを押して新しいセルの高さをあなたのストーリーボードにおいて表示してください。

source: Press Return to display the new placeholder text in the text field.
ja: リターンキーを押して新しいプレースホルダテキストをテキスト欄において表示してください。

source: Press Return to display the new text in the button.
ja: リターンキーを押してボタンの新しいテキストを表示します。

source: Press Return to display the new text in the label.
ja: リターンを押して新しいテキストをラベルにおいて表示します。

source: Press Return.
ja: リターンキーを押します。

source: Press the Return key when you are done editing the description string.
ja: Returnキーを、あなたが説明文字列の編集を終えたならば押してください。

source: Preview Your Interface
ja: あなたのインターフェイスのプレビュー（下見）

source: Preview a storyboard UI using the Assistant editor’s Preview mode
ja: ストーリーボードUIを「Assistant」エディタの「プレビュー」モードを使ってプレビュー（下見）する

source: Preview your app periodically to check that everything is looking the way you expect.
ja: あなたのアプリを定期的にプレビューして、その全てがあなたが求める状態に見えることを確認してください。

source: Private methods can only be called by code within the declaring class.
ja: プライベートメソッドは、宣言しているクラス内のコードによってのみ呼び出されることができます。

source: Process User Input
ja: ユーザ入力処理

source: Process user input from a text field and display the result in the UI
ja: テキスト欄からのユーザ入力の処理とUIでのその結果の表示

source: Product Name: FoodTracker
ja: 製品名：FoodTracker

source: Property observers are called every time a property’s value is set, and can be used to perform work immediately before or after the value changes.
ja: プロパティオブザーバは、あるプロパティの値が設定される時すべてに呼ばれます、そしてその値が変化する直前または直後に作業を実行するために使われることができます。

source: Providing a placeholder size gives the image a temporary intrinsic content size that you can use while designing your user interface.
ja: あるプレースホルダサイズを提供することは、その画像に一時的な固有コンテンツサイズを与えます、それはあなたがあなたのユーザインターフェイスを設計している間に使うことができます。

source: Push navigation is designed for a drill-down interface, where you’re providing more information about whatever the user selected.
ja: プッシュナビゲーションが設計されるのは、ドリルダウンのインターフェイスに対してです—そこではあなたはユーザが選択したことが何であれもっと多くの情報を提供しています。

source: Quit the simulator by choosing Simulator > Quit Simulator (or pressing Command-Q).
ja: シミュレータを、Simulator > Quit Simulatorを選ぶ（またはCommadキー + Qを押す）ことで終了してください。

source: Rebuild the project by typing Command-B (or choosing Product > Build).
ja: プロジェクトをコマンド-Bをタイプすること（またはProduct > Buildを選ぶこと）によって再ビルドしてください。

source: Recall from earlier that the prepare(for:sender:) method is called before any segue gets executed.
ja: 初めの方を思い出してください、prepare(for:sender:)メソッドは何らかのセグエが実行される前に呼ばれます。

source: Recall that a comment is a piece of text in a source code file that doesn’t get compiled as part of the program but provides context or useful information about individual pieces of code.
ja: コメントがソースコードファイル中の一片のテキストであることを思い出してください、それはプログラムの一部としてコンパイルされませんがコードの個々の部分について前後関係や役立つ情報を提供します。

source: Recall that an initializer is a method that prepares an instance of a class for use, which involves setting an initial value for each property and performing any other setup or initialization.
ja: 思い出してください、イニシャライザはあるメソッドです、それはあるクラスのインスタンスを使用するために準備します、それは各プロパティの初期値を設定することと何らかの他の準備や初期化を実行することを伴います。

source: Recall that an initializer is a method that prepares an instance of a class for use, which involves setting an initial value for each property and performing any other setup.
ja: 思い出してください、イニシャライザ（初期化子）はひとつのメソッドです、それはクラスのインスタンスを使用する段取りを整えます、それには各プロパティに対する初期値の設定となんらかの他の設定の実行を伴います。

source: Recall that the Attributes inspector appears when you select the fourth button from the left in the inspector selector bar.
ja: 思い出してください、Attributesインスペクタが現れるのはあなたが左から４番目のボタンをインスペクタ選択バーで選択した時です。

source: Recall that the Identity inspector lets you edit properties of an object in your storyboard related to that object’s identity, such as what class the object belongs to.
ja: 思い出してください、同一性インスペクタは、あなたにあなたのストーリーボードのあるオブジェクトのプロパティをそのオブジェクトの同一性に関して、例えばどのクラスにそのオブジェクトが所属するかなどを、編集させます。

source: Recall that the Size inspector appears when you select the fifth button from the left in the inspector selector bar.
ja: 思い出してください、このサイズインスペクタが現れるのはあなたが左から5番目のボタンをインスペクタ選択バーで選んだ時です。

source: Recall that the asset catalog is a place to store and organize your image assets for an app.
ja: 思い出してください、アセットカタログはあなたのアプリのためのあなたの画像資産を格納し整理するところです。

source: Recall that this method is only called when a user taps the Save button, so you don’t need to account for the Cancel button in this method.
ja: 思い出してください、このメソッドはユーザがSaveボタンをタップした時のみ呼ばれます、それであなたはCancelボタンをこのメソッドにおいて考慮する必要はありません。

source: Recall that you can use the abbreviated form anytime the enumeration value’s type is already known.
ja: 思い出してください、あなたはその列挙値の型がすでに知られているときはいつでも省略形を使うことができます。

source: Remember
ja: 覚えておいてください

source: Remember, Swift defaults to internal access control for all the types, variables, properties, initializers, and functions in your code.
ja: 忘れないでください、Swiftは初期状態であなたのコード中の全ての型、変数、プロパティ、イニシャライザ、そして関数に対して内部アクセス制御になります。

source: Removes all the product files, as well as any object files or other intermediate files created during the build process.
ja: すべての生産ファイルを、それだけでなくビルドプロセスの間に作成されたあらゆるオブジェクトファイルまたは他の中間ファイルを削除します。

source: Rename the file MealViewController.swift.
ja: ファイルをMealViewController.swiftに改名してください。

source: Repeat steps 5–8 for as many images as you like.
ja: ５–８の処置をあなたが望む画像の数だけ繰り返してください。

source: Replace the // Configure the cell comment with the following code:
ja: // Configure the cellコメントを以下のコードと置き換えてください：

source: Replace the print statement with this code:
ja: print文をこのコードと置き換えてください：

source: Replace the placeholder loop variable (_) with index as shown:
ja: プレースホルダループ変数（_）をindexと置き換えてください、次に示すように：

source: Replace this code:
ja: このコードを置き換えてください：

source: Reposition the button, if necessary.
ja: 必要ならば、ボタンの位置を直します。

source: Resize the label so that its right edge stretches to the cell’s right margin.
ja: ラベルを大きさ変更して、それの右端をセルの右余白まで引き延ばしてください。

source: Resize the left and right edges of the text field until you see three vertical layout guides: the left margin alignment, the horizontal center alignment, and the right margin alignment.
ja: テキスト欄の左および右端を、あなたが３つの垂直レイアウトガイド：左余白調節、横中心調節、右余白調節を見るまでリサイズ（大きさ調節）してください。

source: Return to the standard editor by clicking the Standard button.
ja: 標準エディタにStandardボタンをクリックすることで戻ってください。

source: Review the Source Code
ja: ソースコードを調査する

source: Revision History
ja: 改定履歴

source: Right after the else clause, add the following code:
ja: else節のすぐ後で、以下のコードを加えてください：

source: Right after the if statement, add this else clause:
ja: if文のすぐ後で、else節を加えてください：

source: Right now, the Single View Application template doesn’t do much—it just displays a white screen.
ja: 今のところ、Single View Applicationひな形（テンプレート）は、大したことはしません—それはただ白い画面を表示するだけです。

source: Right now, the method declaration is empty.
ja: 今は、このメソッド宣言は空です。

source: Right now, the scene that you see on the canvas contains a single view that’s managed by a view controller.
ja: 今のところ、あなたがキャンバス上で見るこのシーンはただ１つのビューを含みます、それはビューコントローラによって管理されます。

source: Right now, this class simply inherits all the behavior defined by UIViewController.
ja: 今のところ、このクラスはUIViewControllerで定義される挙動のすべてを単に継承します。

source: Right now, you have one button in the view, but you need five total.
ja: 今のところ、あなたはひとつのボタンをこのビューに持ちます、しかしあなたが必要なのは全部で５つです。

source: Right now, your initializers are placeholders that simply call the superclass’s implementation.
ja: 今のところ、あなたのイニシャライザはプレースホルダであり、単にスーパークラスの持つ実装を呼び出します。

source: Ripping out and replacing all of the buttons is not necessarily the best idea from a performance standpoint.
ja: すべてのボタンを剥ぎ取って置き換えることは、性能の見地から必ずしも最良のアイデアではありません。

source: Rotate the simulator by choosing Hardware > Rotate Left and Hardware > Rotate Right (or Command-Left Arrow and Command-Right Arrow).
ja: シミュレータをHardware > Rotate Left and Hardware > Rotate Rightを選ぶこと（またはCommand-Left ArrowおよびCommand-Right Arrow）によって回転させてください。

source: Run all of your unit tests at the same time by choosing Product > Test (or pressing Command-U).
ja: あなたのユニットテストの全てを同時に、Product > Testを選ぶこと（またはCommand-Uを押すこと）によって実行してください。

source: Run an app in iOS Simulator
ja: アプリをiOSシミュレータ（模擬再現プログラム）で実行する

source: Run iOS Simulator
ja: iOSシミュレータの実行

source: Run the app, and you should see the changes in the simulator.
ja: アプリを実行します、するとあなたはシミュレータにおいて変更を見るはずです。

source: Running your app in the simulator with no modifications is a good way to start developing that understanding.
ja: あなたのアプリをシミュレータで変更なしで実行してみるのは、よく理解して開発を始めるのによい方法です。

source: Save and Load the Meal
ja: 食事の保存とロード

source: Save and Load the Meal List
ja: 食事リストの保存とロード

source: Scroll to the bottom of the class.
ja: このクラスの一番下までスクロールしてください。

source: Sections are visual groupings of cells within table views, which is especially useful in table views with a lot of data.
ja: セクションは、テーブルビュー内でのセルの視覚的なグループ分けです、それはテーブルビューにおいて多くのデータがあるとき特に便利です。

source: Select AppDelegate.swift.
ja: AppDelegate.swiftを選択します。

source: Select init(frame: CGRect) from the listed options, and press Return.
ja: init(frame: CGRect)をリストされたオプションから選択してください、そしてReturnを押してください。

source: Select ViewController.swift in the project navigator to view it.
ja: ViewController.swiftをプロジェクトナビゲータにおいて選択してそれを眺めてください。

source: Select Cocoa Touch Class, and click Next.
ja: Cocoa Touch Classを選んで、Nextをクリックしてください。

source: Select Swift File, and click Next.
ja: Swift Fileを選んで、Nextをクリックしてください。

source: Select iOS at the top of the dialog.
ja: ダイアログの一番上でiOSを選んでください。

source: Select the Set Default Label Text button, and press the Delete key to delete it.
ja: Set Default Label Textボタンを選択します、そしてデリートキーを押してそれを消去してください。

source: Select the Stack View object.
ja: Stack Viewオブジェクトを選択してください。

source: Select the bar button item and open the Attributes inspector .
ja: バーボタン項目を選択してAttributesインスペクタ を開いてください。

source: Select the checkbox next to Aspect Ratio.
ja: Aspect Ratio（アスペクト比、縦横比率）の隣のチェックボックスを選択してください。

source: Select the meal detail scene by clicking on its scene dock.
ja: 食事詳細シーンをそれのシーンドックをクリックして選択してください。

source: Select the meal list scene by clicking on its scene dock.
ja: 食事リストシーンをそれのシーンドックをクリックして選択してください。

source: Select the rating control.
ja: 格付けコントロールを選択してください。

source: Select the scene’s view controller to update all the views in the scene.
ja: シーンのビューコントローラを選択することで、シーンの中の全てのビューを更新してください。

source: Select the segue from the meal list scene to the meal detail scene.
ja: 食事リストシーンから食事詳細シーンへのセグエを選択してください。

source: Select the table view controller by clicking on its scene dock until the entire scene has a blue outline around it.
ja: テーブルビューコントローラを、それのシーンドック上でクリックすることで選択してください、シーン全体がその周りに青いアウトラインを持つまで続けます。

source: Select the view controller by clicking on its scene dock.
ja: ビューコントローラをそれのシーンドックをクリックすることで選択してください。

source: Similarly, the view controller has a strong reference to its content view—keeping the entire view hierarchy alive and in memory.
ja: 同じように、ビューコントローラは強い参照をそれのコンテンツビューに対して持ちます — ビュー階層全体を生存させメモリに保っています。

source: Simulator
ja: シミュレータ

source: Size inspector
ja: サイズ（大きさ）インスペクタ

source: Small white squares that appear on a user interface (UI) element’s borders when it’s selected so you can change its size on the canvas.
ja: 小さな白い四角形、それはユーザインターフェイス（UI）要素のへりに、それが選択されることであなたがそれの大きさをキャンバス上で変更できるときに、現れます。

source: So far, all of the tests should succeed.
ja: 今までのところ、テストの全てはうまくいくはずです。

source: So far, the FoodTracker app has a single scene, that is, a single screen of content.
ja: これまでは、FoodTrackerはただ１つだけのシーン、すなわち、単一画面のコンテンツ（内容）を持ちます。

source: So far, the FoodTracker app has a single scene, whose user interface is managed by a single view controller.
ja: これまで、FoodTrackerアプリはただ１つのシーンしか持たず、それはユーザインターフェイスがただ１つのビューコントローラによって管理されます。

source: So it’s important to disable that interaction when it’s in this context.
ja: それでそれがこの状況にある時はこの相互作用を作動しないようにすることが重要です。

source: Some developers prefer to enforce an initializer’s contract using assert() or precondition() methods.
ja: 幾人かの開発者は、イニシャライザがする請負仕事をassert()またはprecondition()メソッドを使って遵守させるのを好みます。

source: Some of these are elements that appear in the user interface, such as buttons and text fields.
ja: それらのいくつかは、ユーザインターフェイスの中に現れる要素です、例えばボタンやテキスト欄など。

source: Sometimes, however, you need more complex communication between your view controllers.
ja: 時には、しかしながら、あなたはより複雑な通信をあなたのビューコントローラ間で必要とします。

source: Specifically, the didSet property observer is called immediately after the property’s value is set.
ja: 具体的には、didSetプロパティオブザーバは、プロパティの値が設定された直後に呼ばれます。

source: Specifically, the comment you added indicates that this is the section of your code that lists properties.
ja: 具体的には、あなたが加えたコメントが示すのは、これがあなたのコードのプロパティをリストする部分だということです。
